### PANDAS
**Dataframe** - Special Object to  store data in tabular form(rows and columns)

In [4]:
import numpy as np
import pandas as pd

In [5]:
user_data = {
    "MarksA":np.random.randint(1,100,5),
    "MarksB":np.random.randint(1,100,5),
    "MarksC":np.random.randint(1,100,5),
    "MarksD":np.random.randint(1,100,5),
}

In [6]:
df = pd.DataFrame(user_data,dtype="float32")
print(df)

   MarksA  MarksB  MarksC  MarksD
0    23.0    49.0    36.0    56.0
1     3.0    77.0     6.0    91.0
2    61.0    51.0    70.0    10.0
3    54.0    64.0    57.0    91.0
4     9.0    48.0    32.0     9.0

### Showing limited amt of rows

In [6]:
# By default it shows data of first 5 rows
df.head()

   MarksA  MarksB  MarksC  MarksD
0      89      55      68      71
1      93      97      14      88
2      53      85      92      19
3      57       3      28      17
4       7      87      42      90

In [7]:
df.head(2)

   MarksA  MarksB  MarksC  MarksD
0      89      55      68      71
1      93      97      14      88

### Getting column headings

In [9]:
# To get headings of all the columns
df.columns

Index(['MarksA', 'MarksB', 'MarksC', 'MarksD'], dtype='object')

### Dataframe to CSV file

In [10]:
df.to_csv("Marks.csv")

In [11]:
Marks_data_read = pd.read_csv("Marks.csv",dtype = int)

In [12]:
Marks_data_read

   Unnamed: 0  MarksA  MarksB  MarksC  MarksD
0           0      89      55      68      71
1           1      93      97      14      88
2           2      53      85      92      19
3           3      57       3      28      17
4           4       7      87      42      90

### Drop a column

In [14]:
Marks_data_read.drop(columns=["Unnamed: 0"])

   MarksA  MarksB  MarksC  MarksD
0      89      55      68      71
1      93      97      14      88
2      53      85      92      19
3      57       3      28      17
4       7      87      42      90